In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
# Series
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['a']

-5

In [8]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [9]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [11]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [24]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [25]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [27]:
# DataFrame
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
}
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [28]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [29]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [30]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [31]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [32]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [34]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [35]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [37]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [38]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [39]:
del frame2['eastern']

In [40]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [41]:
pop = {
    'Neveda': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
}
frame3 = DataFrame(pop)
frame3

      Neveda  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [42]:
frame3.T

        2001  2002  2000
Neveda   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [43]:
DataFrame(pop, index=[2001, 2002, 2003])

      Neveda  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [45]:
pdata = {
    'Ohio': frame3['Ohio'][:-1],
    'Nevada': frame3['Neveda'][:2]
}
DataFrame(pdata)

C:\Users\TJX\AppData\Local\Temp\ipykernel_6612\1587512815.py:2: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  'Ohio':frame3['Ohio'][:-1],
C:\Users\TJX\AppData\Local\Temp\ipykernel_6612\1587512815.py:3: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  'Nevada':frame3['Neveda'][:2]

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [46]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Neveda  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [47]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [48]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [49]:
# 索引对象 index不能修改
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index

In [50]:
index

Index(['a', 'b', 'c'], dtype='object')

In [51]:
index[1:]

Index(['b', 'c'], dtype='object')

In [53]:
# 重新索引
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [55]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [56]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [57]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')  # ffill实现前向值填充 bfill后

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [58]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [59]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [60]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [63]:
# 丢弃指定轴上的项
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [68]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data.drop(['Colorado', 'Ohio'])  # 横

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [71]:
data.drop('two', axis=1)  # 竖

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [70]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [73]:
# 索引
obj = Series(np.arange(4), index=['a', 'b', 'c', 'd'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [74]:
obj['b']

1

In [75]:
obj[1]

1

In [76]:
obj[2:4]

c    2
d    3
dtype: int32

In [77]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: int32

In [78]:
obj[[1, 3]]

b    1
d    3
dtype: int32

In [79]:
obj[obj < 2]

a    0
b    1
dtype: int32

In [80]:
obj['b':'c']

b    1
c    2
dtype: int32

In [81]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: int32

In [82]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [83]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [84]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [85]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [86]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [88]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [104]:
# 数据对齐
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [106]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [107]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [108]:
d1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
               index=['Ohio', 'Texas', 'Colorado'])
d1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [109]:
d2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
               index=['Utah', 'Ohio', 'Texas', 'Oregon'])
d2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [110]:
d1 + d2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [113]:
# 在算术方法中填充值

In [114]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [115]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [116]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [117]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [118]:
# DataFrame与Series之间的运算
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [121]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [122]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [123]:
series2 = Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [124]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [125]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [126]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [127]:
frame.sub(series3, axis=0)  # 减

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [128]:
# 函数应用与映射

In [129]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.338997 -0.534632  1.254870
Ohio   -0.322104  0.118104 -0.306256
Texas  -0.301603  0.600895 -1.023177
Oregon  0.094976 -0.446286  0.368142

In [131]:
np.abs(frame)

               b         d         e
Utah    0.338997  0.534632  1.254870
Ohio    0.322104  0.118104  0.306256
Texas   0.301603  0.600895  1.023177
Oregon  0.094976  0.446286  0.368142

In [132]:
f = lambda x: x.max() - x.min()

In [133]:
frame.apply(f)

b    0.661101
d    1.135526
e    2.278047
dtype: float64

In [134]:
frame.apply(f, axis=1)

Utah      1.789502
Ohio      0.440209
Texas     1.624072
Oregon    0.814427
dtype: float64

In [135]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])


frame.apply(f)

            b         d         e
min -0.322104 -0.534632 -1.023177
max  0.338997  0.600895  1.254870

In [136]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.34  -0.53   1.25
Ohio    -0.32   0.12  -0.31
Texas   -0.30   0.60  -1.02
Oregon   0.09  -0.45   0.37

In [137]:
frame['e'].map(format)

Utah       1.25
Ohio      -0.31
Texas     -1.02
Oregon     0.37
Name: e, dtype: object

In [138]:
# 排序和排名

In [139]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [142]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [143]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [144]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [145]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [147]:
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [148]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()  # 排序时，缺失值会被放到Series末尾

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [149]:
#根据一个或多个列的名字传递给by选项
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [151]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [152]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [153]:
# 排名
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [154]:
obj.rank()  # 增设一个排名值（从一开始，一直到数组中有效数据的数量）

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [155]:
obj.rank(method='first')  # 按值在原始数据中的出现顺序分配排名

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [156]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [157]:
frame = DataFrame({'b': [4.3, 7, -3, 2],
                   'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [158]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [159]:
# 带有重复值的轴索引
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [160]:
obj.index.is_unique

False

In [161]:
obj['a']

a    0
a    1
dtype: int64

In [162]:
obj['c']

4

In [2]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  1.767073  0.544450 -2.994229
a  0.444177 -3.012966  0.949336
b  0.834743 -0.256882 -1.779226
b  1.656573 -1.085668 -0.836262

In [164]:
df.loc['b']

          0         1         2
b  0.168751 -0.527709 -0.142603
b -1.097425  0.913668 -0.352223

In [4]:
# 汇总和计算描述统计
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [7]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [8]:
df.mean(axis=1, skipna=False)  # 不排除nan

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [9]:
df.idxmax()

one    b
two    d
dtype: object

In [10]:
df.cumsum()  # 累加

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [11]:
df.describe()  #

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [12]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [17]:
# 相关系数与协方差
df = DataFrame(np.random.randn(16).reshape((4, 4)),
               columns=['AAPL', 'GOOG', 'IBM', 'MSFT'],
               index=['1-1', '1-2', '1-3', '1-4'])
df

         AAPL      GOOG       IBM      MSFT
1-1  0.153828 -0.494381 -0.317240  0.972606
1-2  0.609772  1.958928  0.092549  0.766941
1-3  2.134420  0.282031 -0.608710 -0.771764
1-4 -2.750691  1.849605 -0.271822 -0.930808

In [18]:
df.corr()  # 相关系数

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000 -0.474418 -0.285522  0.249738
GOOG -0.474418  1.000000  0.632624 -0.263456
IBM  -0.285522  0.632624  1.000000  0.574507
MSFT  0.249738 -0.263456  0.574507  1.000000

In [19]:
df.cov()  #协方差

          AAPL      GOOG       IBM      MSFT
AAPL  4.170703 -1.166575 -0.167734  0.509670
GOOG -1.166575  1.449753  0.219114 -0.316996
IBM  -0.167734  0.219114  0.082747  0.165147
MSFT  0.509670 -0.316996  0.165147  0.998614

In [20]:
# 唯一值
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [21]:
# 值计数
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [22]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [23]:
# 成员资格
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [24]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [25]:
# 得到DataFrame中多个相关列的一个柱状图
data = DataFrame({
    'Qu1': [1, 3, 4, 3, 4],
    'Qu2': [2, 3, 1, 2, 3],
    'Qu3': [1, 5, 2, 4, 4]
})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [26]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [27]:
# 处理缺失数据

In [28]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [29]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [30]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [31]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [32]:
# 滤除缺失数据
from numpy import nan as NA

data = Series([1, NA, 3.5, NA, 7])
data.dropna() # 1

0    1.0
2    3.5
4    7.0
dtype: float64

In [33]:
data[data.notnull()] # 2

0    1.0
2    3.5
4    7.0
dtype: float64

In [34]:
data = DataFrame(
    [
        [1., 6.5, 3.],
        [1., NA, NA],
        [NA, NA, NA],
        [NA, 6.5, 3.]
    ]
)
cleaned = data.dropna()  # 默认舍弃任何含有缺失值的行

In [35]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [36]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [37]:
data.dropna(how='all')  # 只丢弃全为na的行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [38]:
data.dropna(how='all', axis=1)  # 只丢弃全为na的列

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [41]:
# 涉及时间序列数据的dataframe行滤除
df = DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = NA
df.loc[:2, 2] = NA
df

          0         1         2
0 -0.413818       NaN       NaN
1 -1.396887       NaN       NaN
2  0.746017       NaN       NaN
3  0.708059       NaN  0.194846
4  2.823424       NaN  0.642204
5  0.945637  0.451448 -0.315440
6  0.795345  0.543925 -1.055068

In [42]:
df.dropna(thresh=3) # ...

          0         1         2
5  0.945637  0.451448 -0.315440
6  0.795345  0.543925 -1.055068

In [43]:
# 填充缺失数据
df

          0         1         2
0 -0.413818       NaN       NaN
1 -1.396887       NaN       NaN
2  0.746017       NaN       NaN
3  0.708059       NaN  0.194846
4  2.823424       NaN  0.642204
5  0.945637  0.451448 -0.315440
6  0.795345  0.543925 -1.055068

In [44]:
df.fillna(0)

          0         1         2
0 -0.413818  0.000000  0.000000
1 -1.396887  0.000000  0.000000
2  0.746017  0.000000  0.000000
3  0.708059  0.000000  0.194846
4  2.823424  0.000000  0.642204
5  0.945637  0.451448 -0.315440
6  0.795345  0.543925 -1.055068

In [46]:
df.fillna({1: 0.5, 2: -1}) #

          0         1         2
0 -0.413818  0.500000 -1.000000
1 -1.396887  0.500000 -1.000000
2  0.746017  0.500000 -1.000000
3  0.708059  0.500000  0.194846
4  2.823424  0.500000  0.642204
5  0.945637  0.451448 -0.315440
6  0.795345  0.543925 -1.055068

In [47]:
# 层次化索引
data = Series(np.random.randn(10),
              index=[
                  ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                  [1, 2, 3, 1, 2, 3, 4, 2, 2, 3]
              ])
data

a  1    0.062062
   2    0.918697
   3   -2.423158
b  1    1.007996
   2   -0.962076
   3   -1.231897
c  4    0.819884
   2    0.902869
d  2   -1.114802
   3    1.849125
dtype: float64

In [48]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 4),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [50]:
data['b']

1    1.007996
2   -0.962076
3   -1.231897
dtype: float64

In [51]:
data['b':'c']

b  1    1.007996
   2   -0.962076
   3   -1.231897
c  4    0.819884
   2    0.902869
dtype: float64

In [53]:
data.loc[['b', 'd']]

b  1    1.007996
   2   -0.962076
   3   -1.231897
d  2   -1.114802
   3    1.849125
dtype: float64

In [54]:
data[:, 2]

a    0.918697
b   -0.962076
c    0.902869
d   -1.114802
dtype: float64

In [55]:
data.unstack()

          1         2         3         4
a  0.062062  0.918697 -2.423158       NaN
b  1.007996 -0.962076 -1.231897       NaN
c       NaN  0.902869       NaN  0.819884
d       NaN -1.114802  1.849125       NaN

In [56]:
data.unstack().stack()

a  1    0.062062
   2    0.918697
   3   -2.423158
b  1    1.007996
   2   -0.962076
   3   -1.231897
c  2    0.902869
   4    0.819884
d  2   -1.114802
   3    1.849125
dtype: float64

In [57]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[
                      ['a', 'a', 'b', 'b'],
                      [1, 2, 1, 2]
                  ],
                  columns=[
                      ['Ohio', 'Ohio', 'Colorado'],
                      ['Green', 'Red', 'Green']
                  ])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [58]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [59]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [60]:
# 重排分级顺序
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [65]:
# 根据级别汇总信息
frame.sum(level='key2')

C:\Users\TJX\AppData\Local\Temp\ipykernel_10296\2693277976.py:2: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [66]:
frame.sum(level='color', axis=1)

C:\Users\TJX\AppData\Local\Temp\ipykernel_10296\4133796543.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [67]:
# 使用DataFrame的列
frame = DataFrame({
    'a': range(7),
    'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]
})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [68]:
frame.set_index(['c', 'd'])  #将c和d列转换为行索引

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [71]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [72]:
frame.set_index('c', 'd').reset_index()

C:\Users\TJX\AppData\Local\Temp\ipykernel_10296\218176662.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.set_index except for the argument 'keys' will be keyword-only.
  frame.set_index('c','d').reset_index()

     c  a  b  d
0  one  0  7  0
1  one  1  6  1
2  one  2  5  2
3  two  3  4  0
4  two  4  3  1
5  two  5  2  2
6  two  6  1  3